# vim: ft=ruby

# Install command-line tools using Homebrew
# Usage: `brew bundle install`

# Install apps to /Applications by the default is /Users/$user/Applications
cask_args appdir: "/Applications"

# The best shell around
brew "zsh"

# On the fly syntax highlighting for my commands
brew "zsh-syntax-highlighting"

# Additional completions for zsh!
brew "zsh-completions"

# Install GNU core utilities (those that come with OS X are outdated)
# Note: Overwriting system utils by adding the bin to PATH in my .zshrc
brew "coreutils"

# Install GNU `tar`
# Note: Overwriting system tar by adding the bin to PATH in my .zshrc
brew "gnu-tar"

# Install GNU `time`
# Note: as `time` is a shell keyword, we let this install as `gtime`
brew "gnu-time"

# Install GNU `find`, `locate`, `updatedb`, and `xargs`
# Note: Overwriting system utils by adding the bin to PATH in my .zshrc
brew "findutils"

# Install GNU `sed`
# Note: Overwriting system sec by adding the bin to PATH in my .zshrc
brew "gnu-sed"

# Install some other useful utilities like `sponge`
brew "moreutils"

# Watch executes a program periodically showing output fullscreen
brew "watch"

# Programming languages
brew "python3"
brew "lua"

# Need an up to date bash to use Divy's `mapfile` inclusive scripts
brew "bash"

# Builds ruby versions for rbenv
brew "ruby-build"

# Lets me run and install multiple versions of ruby
brew "rbenv"

# Install other useful binaries
# `ag`, way better than grep
brew "the_silver_searcher"

# duh
brew "git"

# Couple scripts use this for giffing
brew "imagemagick"

# I use node and npm for a few different CLI utilities
brew "node"

# 7zip Executable on Linux/Osx
brew "p7zip"

# Great utility to change line endings for files
brew "dos2unix"

# Awesome linting tool for bash scripts
brew "shellcheck"

# Fancy utility for displaying organization of a directory, and it's fast
brew "tree"

# Network Map Hacker Tool - Homepage: http://nmap.org
brew "nmap"

# GPG, encryption utility that is used with `sops`
brew "gpg"

# "Secret Operations", utility for using `gpg` to encrypt secret files
brew "sops"

# Utility for parsing, sorting, modifying json files
brew "jq"

# Download utility
brew "wget"

# Tool for repo cleaning
brew "bfg"


# Things I haven't installed but could
# brew "pigz" # Parallelized Implementation of gzip - Homepage: http://www.zlib.net/pigz/
# brew "pv" # Pipe View Utility - Homepage: http://www.ivarch.com/programs/pv.shtml
# brew "rename" # Rename Utility - Homepage: http://plasmasturm.org/code/rename/
# brew "webkit2png" # Website Screenshotter - Homepage: http://www.paulhammond.org/webkit2png/
# brew "zopfli" # Improved (slow-ass) Compression - Homepage: https://code.google.com/p/zopfli/

cask "alfred"                   # Improved app launcher
# cask "android-file-transfer"    # Required for android phones file transfers
# cask "appcleaner"               # Completely uninstall macOS apps
# cask "feeds"                    # RSS Style notification center for the menu bar
cask "gimp"                     # Open Source image manipulation software
# cask "google-chrome"            # Web browser
cask "hammerspoon"              # Windowing and system automation utility
cask "iterm2"                   # Improved terminal application
# cask "noti"                     # Menu bar buddy that replays messages from my phone
# cask "sdformatter"              # Graphical tool for formatting SD cards
# cask "the-unarchiver"           # Automatically unzip archived files

# Simple non-vim editor
cask "visual-studio-code"

# Fun
cask "spotify"                  # Music streaming client
cask "steam"
cask "vlc"                      # Video player of champions

# Chat client for work
cask "slack"

# Video meeting client for work
cask "zoomus" # Note that the 'zoom' package is something else

# Markdown editor I use everywhere
cask "typora"

# Chat client for work and friends
cask "discord"

# Yet Another Chat App, by Microsoft
cask "microsoft-teams"

# Key Codes utility which shows the keys being pressed
cask "key-codes"

# Karabiner Elements: Keymapping for everything macOS. I use it to make cmd+tab to F19 for Hammerspoon.
cask "karabiner-elements"

# Email client used for work!
cask "microsoft-outlook"

# Spreadsheet client used for work! (duh)
cask "microsoft-excel"

# Documents client used for work! (duh)
cask "microsoft-word"

# Open Source, Cross Platform, Password Manager
cask "keepassxc"

# Install Docker Desktop
cask "docker"

# Google Drive
cask "google-backup-and-sync"
